       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TER0003.

       ENVIRONMENT DIVISION. 
       CONFIGURATION SECTION. 
           OBJECT-COMPUTER. LAB-06.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION. 

       WORKING-STORAGE SECTION. 

       01 AREAS-DE-SALVAMENTO. 
           05  AS-VALOR-1       PIC S9(005)V9(002) VALUE 1200.
           05  AS-VALOR-2       PIC S9(005)V9(002) VALUE -10.
           05  AS-RESULTADO     PIC S9(005)V9(002) VALUE ZEROS.
           05  AS-RESULTADO-EDIT PIC ZZ.ZZZ.ZZZ.ZZ9,99-.

       PROCEDURE DIVISION.
           COMPUTE AS-RESULTADO = AS-VALOR-1 + AS-VALOR-2
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'RESULTADO 1 ' AS-RESULTADO-EDIT

           COMPUTE AS-RESULTADO = AS-VALOR-1 - AS-VALOR-2
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'RESULTADO 2 ' AS-RESULTADO-EDIT

           COMPUTE AS-RESULTADO = AS-VALOR-1 / AS-VALOR-2
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'RESULTADO 3 ' AS-RESULTADO-EDIT
           GOBACK.
           