       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TRE0004.

       ENVIRONMENT DIVISION. 
       CONFIGURATION SECTION. 
           OBJECT-COMPUTER. LAB-06.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION. 

       WORKING-STORAGE SECTION.

       01 AREAS-DE-SALVAMENTO. 
           05  AS-VALOR-1       PIC 9(005)V9(002)  VALUE 2.
           05  AS-VALOR-2       PIC S9(005)V9(002) VALUE -5.
           05  AS-VALOR-3       PIC S9(005)V9(002) VALUE 10.
           05  AS-RESULTADO     PIC S9(005)V9(002) VALUE ZEROS.
           05  AS-RESULTADO-EDIT PIC ZZ.ZZZ.ZZZ.ZZ9,99-.

       PROCEDURE DIVISION.
           DISPLAY 'PROBLEMA 1'

           COMPUTE AS-RESULTADO = AS-VALOR-1 / AS-VALOR-2
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'VAR1 / VAR2 = ' AS-RESULTADO-EDIT

           DISPLAY 'PROBLEMA 2'
           COMPUTE AS-RESULTADO = AS-VALOR-3 / AS-VALOR-1
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'VAR3 / VAR1 = ' AS-RESULTADO-EDIT
           
           DISPLAY 'PROBLEMA 3'
           COMPUTE AS-RESULTADO = AS-VALOR-2 / AS-VALOR-1
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'VAR2 / VAR1 = ' AS-RESULTADO-EDIT
           
           DISPLAY 'PROBLEMA 4'
           COMPUTE AS-RESULTADO = AS-VALOR-2 / AS-VALOR-3
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'VAR2 / VAR3 = ' AS-RESULTADO-EDIT
           
           DISPLAY 'PROBLEMA 5'
           COMPUTE AS-RESULTADO = AS-VALOR-3 / AS-VALOR-2
           MOVE AS-RESULTADO TO AS-RESULTADO-EDIT
           DISPLAY 'VAR3 / VAR2 = ' AS-RESULTADO-EDIT

           GOBACK.


